wisteria-1c/Конфигурация/DataProcessors/ПанельОбменЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПанельОбменЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ОчередьПередачиДанныхЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПередачиДанныхЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕГАИСПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ВскрытыеПотребительскиеУпаковкиИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВскрытыеПотребительскиеУпаковкиИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОборудованиеРозливаИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВскрытыхПотребительскихУпаковокИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключения</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемСлива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШтрихкодУпаковкиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НастройкиОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресУТМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортУТМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьВходящиеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРесурсОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРесурсСклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФСРАР</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочиеМестаИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИзмерениеОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИзмерениеСклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/ТранспортнаяНакладнаяЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ТранспортнаяНакладнаяЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварВПутиПринадлежитГрузополучателю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТранспортаЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перенаправление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеТранспортнаяНакладнаяЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварноТранспортнаяНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТТНИсходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеНакладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
								<v8:Type>cfg:DocumentRef.ТранспортнаяНакладнаяЕГАИС</v8:Type>
								<v8:Type>cfg:DocumentRef.ТТНИсходящаяЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/ПанельОбменЕГАИС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УпрощеннаяИнтеграцияБЭД                    = ИнтеграцияИС.УпрощеннаяИнтеграцияБЭД();
	ЕстьПравоСоздаватьНастройкиПодключенияКУТМ = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НастройкиОбменаЕГАИС);
	
	НастроитьВидимость();
	
	Если Не ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85() Тогда
		ИнтеграцияИС.УстановитьОдиночныйВертикальныйИнтервалГруппыФормы(Элементы.ГруппаОсновное);
	КонецЕсли;
	
	ВосстановитьНастройкиФормы();
	ОбновитьСпискиДокументов();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТребуетсяНастроитьПодключениеКУТМ И ЕстьПравоСоздаватьНастройкиПодключенияКУТМ Тогда
		ПодключитьОбработчикОжидания("ОткрытьФормуСозданияПодключенияЕГАИС", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КлассификаторОрганизацийЕГАИС" Тогда
		ОтобразитьСостояниеОбмена();
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВыполнитьОбмен" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОбменДаннымиЕГАИСКлиент.ВыполнитьОбмен(
			ИнтеграцияЕГАИСКлиент.ОрганизацииЕГАИСДляОбмена(
				ЭтотОбъект),,
			УникальныйИдентификатор);
		
		КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьСостояниеОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкаПодключенияУТМ" Тогда
		
		Если ЕстьПравоСоздаватьНастройкиПодключенияКУТМ Тогда
			ОткрытьФормуСозданияПодключенияЕГАИС();
		Иначе
			ПоказатьПредупреждение( , НСтр("ru = 'Для настройки подключения к УТМ обратитесь к администратору.'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЕстьСообщенияОжидающиеОтправки" Тогда
		
		ПараметрыОткрытияФормы = Неопределено;
		Если ОрганизацииЕГАИС.Количество() > 0 Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОрганизацияЕГАИС", ОрганизацииЕГАИС.ВыгрузитьЗначения());
			
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
			
		КонецЕсли;
		
		ОткрытьФорму(
			"РегистрСведений.ОчередьПередачиДанныхЕГАИС.ФормаСписка",
			ПараметрыОткрытияФормы);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ХранитьФайлыВТомахНаДиске" Тогда
		
		Если ПравоДоступаНастройкиРаботыСФайлами() Тогда
			ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиРаботыСФайлами");
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Вам запрещено выполнение данной операции, обратитесь к администратору'"));
		КонецЕсли;
		
	Иначе //ОткрытьПанельСостоянияОбмена
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Организации", ОрганизацииЕГАИС);
		
		ОткрытьФорму(
			"Обработка.ПанельОбменЕГАИС.Форма.СостоянияОбмена",
			ПараметрыОткрытияФормы, ЭтотОбъект,,,,,
			РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#Область ОтборПоОрганизацииЕГАИС

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСПриИзменении(Элемент)
	
	Элементы.ОткрытьWebИнтерфейсУТМ.Видимость = ЗначениеЗаполнено(ОрганизацииЕГАИС);
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацииЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборОрганизацияЕГАИСПриИзменении(Элемент)
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацияЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект,
		"Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаЕГАИСНажатие(Элемент)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияЕГАИС.Форма.НастройкиЕГАИС", , ЭтотОбъект);
	
КонецПроцедуры

#Область ТТНВходщиеЕГАИС

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ТТНИсходящаяЕГАИС

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ТранспортнаяНакладнаяЕГАИС

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТранспортнаяНакладнаяЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТранспортнаяНакладнаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктПостановкиНаБалансЕГАИС

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктСписанияЕГАИС

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаВРегистр2ЕГАИС

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратИзРегистра2ЕГАИС

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИС

&НаКлиенте
Процедура ОткрытьЧекЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИСВозврат

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВскрытыеПотребительскиеУпаковкиИС

&НаКлиенте
Процедура ОткрытьВскрытыеПотребительскиеУпаковкиИСНажатие(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Форма.ФормаСписка.ОткрытиеОсновногоСписка");
	ОткрытьФормуСпискаДокументов("РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиЕГАИС

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросыАкцизныхМарокЕГАИС

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыЕГАИС

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияОНачалеОборотаЕГАИС

&НаКлиенте
Процедура ОткрытьУведомлениеОНачалеОборотаЕГАИС(Команда)
	
	ОчиститьСообщения();
	
	Если ОрганизацииЕГАИС.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Организация ЕГАИС""'"),,
			"ОрганизацияЕГАИС");
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() = 1 Тогда
		
		ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ОрганизацияЕГАИС);
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() > 1 Тогда
		
		ОрганизацииЕГАИС.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения(
				"ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаФРАПУТМ", ЭтотОбъект),
				НСтр("ru = 'Выбор организации ЕГАИС'"),
				ОрганизацииЕГАИС.Получить(0));
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетОПроизводствеЕГАИС

&НаКлиенте
	Процедура ОткрытьОтчетОПроизводствеЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПроизводствеЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияОПланируемомИмпортеЕГАИС

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомленияОПланируемомИмпортеЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыОбИмпортеЕГАИС

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОформитеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОтработайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИмпортеЕГАИСОжидайтеНажатие(Элемент)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьПомощникКорректировкиОстатковНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура("Организация", ОрганизацияЕГАИС);
	ОткрытьФорму("Обработка.ПомощникКорректировкиОстатковЕГАИС.Форма.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОбменДаннымиЕГАИСКлиент.ВыполнитьОбмен(
		ИнтеграцияЕГАИСКлиент.ОрганизацииЕГАИСДляОбмена(
			ЭтотОбъект),,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьWebИнтерфейсУТМ(Команда)
	
	ОчиститьСообщения();
	
	Если ОрганизацииЕГАИС.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Организация ЕГАИС""'"),,
			"ОрганизацияЕГАИС");
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() = 1 Тогда
		
		ВыполнитьОткрытьWebИнтерфейсУТМ(ОрганизацияЕГАИС);
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() > 1 Тогда
		
		ОрганизацииЕГАИС.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения(
				"ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ", ЭтотОбъект),
				НСтр("ru = 'Выбор организации ЕГАИС'"),
				ОрганизацииЕГАИС.Получить(0));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАкцизныеМаркиНаОстаткахОрганизации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации"));
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРежимаОтладки(Команда)
	
	ОткрытьФорму("Обработка.ПанельОбменЕГАИС.Форма.НастройкиРежимаОтладки");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда) Экспорт
	
	СобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимость()
	
	Элементы.ГруппаПомощникКорректировкиОстатков.Видимость    = ПравоДоступа("Использование", Метаданные.Обработки.ПомощникКорректировкиОстатковЕГАИС);
	
	Элементы.ГруппаПроизводствоИмпорт.Видимость               = ИнтеграцияЕГАИСИСМП.ДоступнаРаботаСКодамиМаркировкиИСМП();
	Элементы.ОткрытьУведомлениеОНачалеОборотаЕГАИС.Видимость  = ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП");
	
	Элементы.НастройкаЕГАИС.Видимость                          = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаСмТакже.Видимость                           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаВскрытыеПотребительскиеУпаковкиИС.Видимость = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаЗапросАкцизныхМарокЕГАИС.Видимость          = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаПередачаВРегистр2ЕГАИС.Видимость            = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.ГруппаВозвратИзРегистра2ЕГАИС.Видимость           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.Ответственный.Видимость                           = Не УпрощеннаяИнтеграцияБЭД;
	Элементы.СтраницыОтборОрганизацияЕГАИС.Видимость           = Не УпрощеннаяИнтеграцияБЭД;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		ТекстЗаголовка = НСтр("ru='Настройки и справочники'");
	Иначе
		ТекстЗаголовка = НСтр("ru='Справочники'");
	КонецЕсли;
	Элементы.НастройкаЕГАИС.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка);
	
	ОбменДаннымиЕГАИС.УстановитьВидимостьКомандыВыполнитьОбмен(ЭтотОбъект, "ФормаВыполнитьОбмен");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресИПортУТМ(ОрганизацияЕГАИС)
	
	ВозвращаемоеЗначение = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОбменаЕГАИС.АдресУТМ КАК АдресУТМ,
	|	НастройкиОбменаЕГАИС.ПортУТМ КАК ПортУТМ
	|ИЗ
	|	РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|		ПО НастройкиОбменаЕГАИС.ИдентификаторФСРАР = КлассификаторОрганизацийЕГАИС.Код
	|		И КлассификаторОрганизацийЕГАИС.Ссылка = &ОрганизацияЕГАИС
	|ГДЕ
	|	НастройкиОбменаЕГАИС.РабочееМесто = &РабочееМесто
	|	ИЛИ НастройкиОбменаЕГАИС.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("РабочееМесто",     МенеджерОборудованияВызовСервера.РабочееМестоКлиента());
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("АдресУТМ", Выборка.АдресУТМ);
		ВозвращаемоеЗначение.Вставить("ПортУТМ",  Выборка.ПортУТМ);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	ОрганизацииЕГАИС = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	Ответственный    = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
	ИнтеграцияЕГАИС.ОтборПоОрганизацииПриСозданииНаСервере(ЭтотОбъект, "Отбор");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокумент(Таблица, МетаданныеОбъекта, Заголовок, Оформите = Истина, Отработайте = Истина, Ожидайте = Истина)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Метаданные  = МетаданныеОбъекта;
	НоваяСтрока.Заголовок   = Заголовок;
	НоваяСтрока.Оформите    = Оформите;
	НоваяСтрока.Отработайте = Отработайте;
	НоваяСтрока.Ожидайте    = Ожидайте;
	
	Если МетаданныеОбъекта = Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС Тогда
		НоваяСтрока.ЕстьПравоЧтение         = ПравоДоступа("Чтение", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоРедактирование = ПравоДоступа("Редактирование", МетаданныеОбъекта);
	Иначе
		НоваяСтрока.ЕстьПравоЧтение         = ПравоДоступа("Чтение", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоРедактирование = ПравоДоступа("Редактирование", МетаданныеОбъекта);
		НоваяСтрока.ЕстьПравоДобавление     = ПравоДоступа("Добавление", МетаданныеОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументов()
	
	ОбновитьСпискиДокументовЕГАИС();
	ОтобразитьСостояниеОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументовЕГАИС()
	
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Метаданные");
	ТаблицаДокументы.Колонки.Добавить("Заголовок");
	ТаблицаДокументы.Колонки.Добавить("Оформите");
	ТаблицаДокументы.Колонки.Добавить("Отработайте");
	ТаблицаДокументы.Колонки.Добавить("Ожидайте");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоЧтение");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоДобавление");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоРедактирование");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНВходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные (входящие)'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНИсходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные (исходящие)'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС,
		НСтр("ru = 'Транспортные накладные'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктПостановкиНаБалансЕГАИС,
		НСтр("ru = 'Акты постановки на баланс'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктСписанияЕГАИС,
		НСтр("ru = 'Акты списания'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОстаткиЕГАИС,
		НСтр("ru = 'Остатки'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетЕГАИС,
		НСтр("ru = 'Отчеты'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС,
		НСтр("ru = 'Запросы акцизных марок'"),
		Ложь);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИС,
		НСтр("ru = 'Чеки ЕГАИС'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИСВозврат,
		НСтр("ru = 'Чеки ЕГАИС на возврат'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.УведомлениеОПланируемомИмпортеЕГАИС,
		НСтр("ru = 'Уведомления о планируемом импорте'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетОбИмпортеЕГАИС,
		НСтр("ru = 'Отчеты об импорте'"));
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетОПроизводствеЕГАИС,
		НСтр("ru = 'Отчеты о производстве'"));
	
	Если Не УпрощеннаяИнтеграцияБЭД Тогда
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.Документы.ПередачаВРегистр2ЕГАИС,
			НСтр("ru = 'Передачи в регистр №2'"));
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.Документы.ВозвратИзРегистра2ЕГАИС,
			НСтр("ru = 'Возвраты из регистра №2'"),
			Ложь);
		
		ДобавитьДокумент(
			ТаблицаДокументы,
			Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС,
			СокрЛП(СтрЗаменить(ОбщегоНазначенияИСПовтИсп.ПредставленияВскрытыхПотребительскихУпаковок("ЕГАИС").ЗаголовокСписка, "ЕГАИС", "")),
			Ложь,    // Оформите
			Ложь,  // Отработайте
			Ложь); // Ожидайте
		
	КонецЕсли;
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ВсеТребующиеОжидания = Новый Массив;
	ВсеТребующиеДействия = Новый Массив;
	
	Для Каждого ТекЭлемент Из ТаблицаДокументы Цикл
		
		Если Не ТекЭлемент.ЕстьПравоЧтение Тогда
			Элементы["Группа" + ТекЭлемент.Метаданные.Имя].Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлемент.Метаданные = Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТекЭлемент.Метаданные.ПолноеИмя());
		
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеОжидания() Цикл
			Если ВсеТребующиеОжидания.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеОжидания.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеДействия() Цикл
			Если ВсеТребующиеДействия.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеДействия.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		
		Если ТекЭлемент.Оформите И ТекЭлемент.ЕстьПравоДобавление Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОформите(),
				ТекЭлемент.Метаданные.Имя + "Оформите");
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте И ТекЭлемент.ЕстьПравоРедактирование Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОтработайте(),
				ТекЭлемент.Метаданные.Имя + "Отработайте");
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОжидайте(),
				ТекЭлемент.Метаданные.Имя + "Ожидайте");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОрганизацияЕГАИС",            ОрганизацииЕГАИС);
	ПараметрыЗапроса.Вставить("БезОтбораПоОрганизацииЕГАИС", ОрганизацииЕГАИС.Количество() = 0);
	ПараметрыЗапроса.Вставить("Ответственный",        ?(ЗначениеЗаполнено(Ответственный), Ответственный,    Неопределено));
	ПараметрыЗапроса.Вставить("ВсеТребующиеОжидания", ВсеТребующиеОжидания);
	ПараметрыЗапроса.Вставить("ВсеТребующиеДействия", ВсеТребующиеДействия);
	
	Запрос = Новый Запрос;
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	Для ТекИндекс = 0 По ТаблицаДокументы.Количество() - 1 Цикл
		
		ТекЭлемент = ТаблицаДокументы[ТекИндекс];
		ИмяДокумента = ТекЭлемент.Метаданные.Имя;
		
		Если НЕ ТекЭлемент.ЕстьПравоЧтение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлемент.Оформите Тогда
			КнопкаОформите = Элементы["Открыть" + ИмяДокумента + "Оформите"];
			ПустаяОформите = Элементы["Открыть" + ИмяДокумента + "ОформитеДекорация"];
			ТекстОформите  = НСтр("ru = 'оформите'");
			
			Если ТекЭлемент.ЕстьПравоДобавление Тогда
				
				Выборка = РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать();
				
				Если ТекЭлемент.Метаданные = Метаданные.Документы.ПередачаВРегистр2ЕГАИС Тогда
					
					СобытияФормИС.ВывестиПоказатель(
						Выборка, КнопкаОформите, ТекстОформите, Истина, Ложь);
					
				ИначеЕсли ТекЭлемент.Метаданные = Метаданные.Документы.АктПостановкиНаБалансЕГАИС Тогда
					
					КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
					
					Если Цел(КоличествоДокументов) > 0 Тогда
						СобытияФормИС.ВывестиПоказатель(Цел(КоличествоДокументов), КнопкаОформите, ТекстОформите, Истина);
					ИначеЕсли КоличествоДокументов > 0 Тогда
						СобытияФормИС.ВывестиПоказатель(1, КнопкаОформите, ТекстОформите, Истина, Ложь);
					Иначе
						СобытияФормИС.ВывестиПоказатель(0, КнопкаОформите, ТекстОформите, Истина);
					КонецЕсли;
				
				Иначе
					
					СобытияФормИС.ВывестиПоказатель(
						Выборка, КнопкаОформите, ТекстОформите, Истина);
					
				КонецЕсли;
				
				ПустаяОформите.Видимость = Ложь;
			Иначе
				КнопкаОформите.Видимость = Ложь;
				ПустаяОформите.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте Тогда
			КнопкаОтработайте = Элементы["Открыть" + ИмяДокумента + "Отработайте"];
			ПустаяОтработайте = Элементы["Открыть" + ИмяДокумента + "ОтработайтеДекорация"];
			ТекстОтработайте  = НСтр("ru = 'отработайте'");
			
			Если ТекЭлемент.ЕстьПравоРедактирование Тогда
				 СобытияФормИС.ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Отработайте"].Выбрать(), КнопкаОтработайте, ТекстОтработайте, Истина);
				
				ПустаяОтработайте.Видимость = Ложь;
			Иначе
				КнопкаОтработайте.Видимость = Ложь;
				ПустаяОтработайте.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			КнопкаОжидайте = Элементы["Открыть" + ИмяДокумента + "Ожидайте"];
			ТекстОжидайте  = НСтр("ru = 'ожидайте'");
			
			СобытияФормИС.ВывестиПоказатель(
				РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Ожидайте"].Выбрать(), КнопкаОжидайте, ТекстОжидайте, Истина);
		КонецЕсли;
		
		СобытияФормИС.ВывестиПоказатель(
			1,
			Элементы["Открыть" + ИмяДокумента],
			ТекЭлемент.Заголовок,
			Истина,
			Ложь,
			Истина);
		
	КонецЦикла;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеОбмена()
	
	РезультатыЗапроса = ИнтеграцияЕГАИС.СостояниеОбмена(ОрганизацииЕГАИС);
	
	ПерваяПроблема                      = Неопределено;
	ПерваяПроблемаФорматированнаяСтрока = Неопределено;
	ТекстПодсказкиФорматированнаяСтрока = Неопределено;
	
	ЕщеПроблемы    = 0;
	
	Элементы.НадписьСостояниеОбмена.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	Элементы.НадписьСостояниеОбменаРасширеннаяПодсказка.Заголовок = "";
	
	//@skip-check bsl-legacy-check-string-literal
	НастройкиПодключения = РезультатыЗапроса["НастройкиОбменаЕГАИС"].Выбрать();
	Если НастройкиПодключения.Количество() = 0 Тогда
		
		Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85() Тогда
			Элементы.НадписьСостояниеОбмена.Заголовок = Новый ФорматированнаяСтрока(
				НСтр("ru='Настройте подключение к УТМ'"),,,,
				"НастройкаПодключенияУТМ");
		Иначе
			Элементы.НадписьСостояниеОбмена.Заголовок = Новый ФорматированнаяСтрока(
				НСтр("ru='Настройте подключение к УТМ'"),,
				ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС,,
				"НастройкаПодключенияУТМ");
		КонецЕсли;
		
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Истина;
		Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный;
		Элементы.НадписьСостояниеОбмена.Видимость         = Истина;
		
		УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере();
		Возврат;
		
	КонецЕсли;
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
		И Не ОбщегоНазначения.РазделениеВключено()
		И Не ИнтеграцияИС.ХранитьФайлыВТомахНаДиске() Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			ПерваяПроблема = НСтр("ru='Рекомендуется настроить хранение файлов в томах на диске'");
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				ПерваяПроблема,,,,
				"ХранитьФайлыВТомахНаДиске");
			Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
			
			ТекстПодсказки = Новый Массив;
			ТекстПодсказки = НСтр("ru='Файлы обмена могут занимать значительный объем данных в базе.
			|Для уменьшения объема базы данных, файлы необходимо хранить в томах на диске.'");
			
			Если Не ПравоДоступаНастройкиРаботыСФайлами() Тогда
				ТекстПодсказки = ТекстПодсказки + Символы.ПС
					+ НСтр("ru='У Вас недостачно прав для выполнения данной операции, обратитесь к администратору.'");
			КонецЕсли;
			ТекстПодсказкиФорматированнаяСтрока = ТекстПодсказки;
			
		КонецЕсли;
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	Проблемы = РезультатыЗапроса["ЕстьСообщенияОжидающиеОтправки"].Выбрать();
	Если Проблемы.Количество() > 0 Тогда
		
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			Проблемы.Следующий();
			ПерваяПроблема = СтрШаблон(
				НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ЕГАИС. Выполните обмен.'"),
				Проблемы.КоличествоСообщений);
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				ПерваяПроблема,,,,
				"ЕстьСообщенияОжидающиеОтправки");
			Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаИнформация;
			
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				СтрШаблон(
					НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ЕГАИС.'"),
					Проблемы.КоличествоСообщений),,,,
				"ЕстьСообщенияОжидающиеОтправки");
			
			ТекстПодсказки = Новый Массив;
			ТекстПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru = 'Не все подготовленные для отправки сообщения доставлены в ЕГАИС. Рекомендуется'")));
			ТекстПодсказки.Добавить(" ");
			ТекстПодсказки.Добавить(
				Новый ФорматированнаяСтрока(
					Нстр("ru='выполнить обмен'"),,,, "ВыполнитьОбмен"));
			ТекстПодсказки.Добавить(".");
			
			ТекстПодсказкиФорматированнаяСтрока = Новый ФорматированнаяСтрока(ТекстПодсказки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Метаданные",    "ОбработкаОтветовЕГАИС");
		Отбор.Вставить("Использование", Истина);
		
		УстановитьПривилегированныйРежим(Истина);
		ЗаданиеВключено = РегламентныеЗаданияСервер.НайтиЗадания(Отбор).Количество() > 0;
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не ЗаданиеВключено Тогда
			Если ПерваяПроблема <> Неопределено Тогда
				ЕщеПроблемы = ЕщеПроблемы + 1;
			Иначе
				ПерваяПроблема = НСтр("ru='Рекомендуется настроить автоматический обмен с ЕГАИС'");
				ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
						ПерваяПроблема,,,,
						"НастроитьАвтоматическийОбмен");
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначенияИС.СерииИспользуются() Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Метаданные",    "СверткаРегистраСоответствиеНоменклатурыЕГАИС");
			Отбор.Вставить("Использование", Истина);
			
			УстановитьПривилегированныйРежим(Истина);
			ЗаданиеВключено = РегламентныеЗаданияСервер.НайтиЗадания(Отбор).Количество() > 0;
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Не ЗаданиеВключено Тогда
				Если ПерваяПроблема <> Неопределено Тогда
					ЕщеПроблемы = ЕщеПроблемы + 1;
				Иначе
					ПерваяПроблема = НСтр("ru='Рекомендуется настроить свертку регистра соответствия номенклатуры ЕГАИС'");
					ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
						ПерваяПроблема,,,,
						"СверткаРегистраСоответствиеНоменклатурыЕГАИС");
					Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПроблемыКлассификаторов = ИнтеграцияЕГАИС.ПроблемыКлассификаторовВПанелиОбмена();
	Если ЗначениеЗаполнено(ПроблемыКлассификаторов.ДоступноОбновлениеОписание) Тогда
		Если ПерваяПроблема <> Неопределено Тогда
			ЕщеПроблемы = ЕщеПроблемы + 1;
		Иначе
			ПерваяПроблема = ПроблемыКлассификаторов.ДоступноОбновлениеОписание;
			ПерваяПроблемаФорматированнаяСтрока = Новый ФорматированнаяСтрока(
				ПерваяПроблема,,,,
				"ПроблемыКлассификаторовВПанелиОбмена");
			Если ПроблемыКлассификаторов.ЭтоКритичнаяПроблема Тогда
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный;
			Иначе
				Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПерваяПроблема <> Неопределено Тогда
		
		Если ЕщеПроблемы > 0 Тогда
			ТекстЗаголовка = СтрШаблон(НСтр("ru='%1 ( + еще %2 )'"), ПерваяПроблема, ЕщеПроблемы);
			Элементы.НадписьСостояниеОбмена.Заголовок = Новый ФорматированнаяСтрока(
				ТекстЗаголовка,,,,
				"ОткрытьПанельСостоянияОбмена");
		Иначе
			Элементы.НадписьСостояниеОбмена.Заголовок = ПерваяПроблемаФорматированнаяСтрока;
			Если ТекстПодсказкиФорматированнаяСтрока <> Неопределено Тогда
				Элементы.НадписьСостояниеОбмена.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
				Элементы.НадписьСостояниеОбменаРасширеннаяПодсказка.Заголовок = ТекстПодсказкиФорматированнаяСтрока;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Истина;
		Элементы.НадписьСостояниеОбмена.Видимость         = Истина;
		
		УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере();
		
	Иначе
		Элементы.ГруппаДекорацияСостояниеОбмена.Видимость = Ложь;
		Элементы.НадписьСостояниеОбмена.Видимость         = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы,
	                                   ДальнейшееДействиеЕГАИС,
	                                   ОткрытьРаспоряжения = Ложь,
	                                   ИмяПоляОтветственный = Неопределено,
	                                   ИмяПоляОрганизация = Неопределено)
	
	СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	Если ОткрытьРаспоряжения Тогда
		ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	ИначеЕсли ДальнейшееДействиеЕГАИС <> Неопределено Тогда
		СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеЕГАИС", ДальнейшееДействиеЕГАИС);
	КонецЕсли;
	
	Если ИмяПоляОтветственный = Неопределено Тогда
		ИмяПоляОтветственный = "Ответственный";
	КонецЕсли;
	
	Если ИмяПоляОрганизация = Неопределено Тогда
		ИмяПоляОрганизация = "ОрганизацияЕГАИС";
	КонецЕсли;
	
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОтветственный, Ответственный);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация,   ОрганизацииЕГАИС);
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если ИмяФормы = "РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС" Тогда
		ПараметрыОткрытия = ОбщегоНазначенияИСКлиент.ПараметрыОткрытияФормыСпискаПотребительскихУпаковок();
		ПараметрыОткрытия.ПараметрыФормы = ПараметрыФормы;
		ОбщегоНазначенияЕГАИСКлиент.ОткрытьФормуСпискаВскрытыхПотребительскихУпаковок(ПараметрыОткрытия);
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОрганизацииЕГАИС(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС)
	
	ПараметрыУТМ = АдресИПортУТМ(ВыбраннаяОрганизацияЕГАИС);
	Если ПараметрыУТМ <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			"http://" + ПараметрыУТМ.АдресУТМ + ":" + Формат(ПараметрыУТМ.ПортУТМ, "ЧГ=0") + "/");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Не заданы параметры подключения к УТМ для организации ЕГАИС %1'"), ВыбраннаяОрганизацияЕГАИС),,
			"ОрганизацияЕГАИС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ВыбраннаяОрганизацияЕГАИС)
	
	ПараметрыУТМ = АдресИПортУТМ(ВыбраннаяОрганизацияЕГАИС);
	Если ПараметрыУТМ <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			"http://" + ПараметрыУТМ.АдресУТМ + ":" + Формат(ПараметрыУТМ.ПортУТМ, "ЧГ=0")
				 + "/app/services/notification-beginning-turnover");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Не заданы параметры подключения к УТМ для организации ЕГАИС %1'"), ВыбраннаяОрганизацияЕГАИС),,
			"ОрганизацияЕГАИС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ(ВыбраннаяОрганизацияЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизацияЕГАИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС.Значение);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаФРАПУТМ(ВыбраннаяОрганизацияЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизацияЕГАИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОткрытьWebИнтерфейсФРАПУТМ(ВыбраннаяОрганизацияЕГАИС.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияПодключенияЕГАИС()
	
	ПараметрыОткрытияФормы = Неопределено;
	ОткрытьФорму(
		"РегистрСведений.НастройкиОбменаЕГАИС.Форма.ФормаЗаписи",
		ПараметрыОткрытияФормы, ЭтотОбъект,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоДоступаНастройкиРаботыСФайлами()
	
	Возврат ИнтеграцияИС.ПравоДоступаПанельАдминистрированиеБСП();
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеГруппыСостояниеОбменаНаСервере()
	
	ОформляемыеГруппыФормы = ОбщегоНазначенияИС.НоваяСтруктураОформляемыхГруппФормы();
	Если Элементы.ГруппаДекорацияСостояниеОбмена.Видимость Тогда
		Если Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаЖелтый Тогда
			ОформляемыеГруппыФормы.Предупреждение = "ГруппаИнформация";
		ИначеЕсли Элементы.ГруппаДекорацияСостояниеОбмена.ТекущаяСтраница = Элементы.СостояниеОбменаКрасный Тогда
			ОформляемыеГруппыФормы.Ошибка = "ГруппаИнформация";
		Иначе //СостояниеОбменаИнформация
			ОформляемыеГруппыФормы.Информация = "ГруппаИнформация";
		КонецЕсли;
	Иначе
		ОформляемыеГруппыФормы.ОчиститьОформление = "ГруппаИнформация";
	КонецЕсли;
	ОбщегоНазначенияИС.УстановитьОформлениеГруппФормы(ЭтотОбъект, ОформляемыеГруппыФормы);
	
КонецПроцедуры

#КонецОбласти
